tap 'homebrew/cask-drivers'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

tap 'warrensbox/tap'

# Install homebrew formulas

brew 'dockutil'
brew 'dos2unix'
brew 'fd'
brew 'gettext'
brew 'git'
brew 'httpie'
brew 'jq'
brew 'jump'
brew 'mercurial'
brew 'trash'
brew 'upx'
brew 'wget'
brew 'yamllint'
brew 'yq'

brew 'htop'
brew 'nmap'
brew 'telnet'
brew 'tree'

brew 'go'
brew 'hugo'
brew 'nvm'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'yarn'

brew 'ansible'
brew 'awscli'
brew 'multipass'
brew 'packer'
brew 'tfswitch'
brew 'tgswitch'

brew 'helm'
brew 'k3d'
brew 'kops'
brew 'kubectx'
brew 'kubernetes-cli'

brew 'zsh-autosuggestions'
brew 'zsh-completion'
brew 'zsh-syntax-highlighting'

brew 'java'
brew 'git-credential-manager'

brew 'mas'

# Install cask applications

cask 'appcleaner'

cask '1password'
cask '1password-cli'
cask 'authy'
cask 'lastpass'

cask 'istat-menus'
cask 'beardedspice'
cask 'shiftit'
cask 'rectangle'

cask 'bluejeans'
cask 'discord'
cask 'google-hangouts'
cask 'keybase'
cask 'skype'
cask 'slack-beta'
cask 'zoomus'
cask 'grammarly'

cask 'spotify'
cask 'vlc'

cask 'lens'
cask 'docker'
cask 'iterm2'
cask 'ngrok'
cask 'pycharm-ce'
cask 'visual-studio-code'

cask 'brave-browser'
cask 'firefox-developer-edition'
cask 'google-chrome-canary'
cask 'opera-developer'
cask 'tor-browser'

cask 'mysqlworkbench'
cask 'pgadmin4'

cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'microsoft-teams'

cask 'diffmerge'
cask 'sourcetree'
cask 'the-unarchiver'

cask 'ledger-live'
cask 'logitech-g-hub'
cask 'tunnelblick'

# Install cask fonts

cask 'font-meslo-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Install Mac AppStore applications

mas "harvest", id: 506189836
mas "numbers", id: 409203825
mas "grammarly", id: 1462114288
