tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

tap "golangci/tap"
tap "goreleaser/tap"
tap "heroku/brew"

tap "warrensbox/tap"
tap "romkatv/powerlevel10k"

# Install homebrew formulas

brew 'dos2unix'
brew 'fd'
brew 'gettext'
brew 'git'
brew 'httpie'
brew 'jq'
brew 'jump'
brew 'mercurial'
brew 'trash'
brew 'wget'
brew 'yamllint'
brew 'yq'
brew 'bat'

brew 'htop'
brew 'nmap'
brew 'telnet'
brew 'tree'

brew 'go'
brew 'hugo'
brew 'nvm'
brew 'pyenv'
brew 'pyenv-virtualenv'
brew 'rbenv'
brew 'yarn'
brew 'zig'
brew 'rustup-init'

brew 'ansible'
brew 'awscli'
brew 'packer'

brew 'helm'
brew 'k3d'
brew 'kops'
brew 'kubectx'
brew 'kubernetes-cli'

brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

brew 'java'

brew 'mas'

# Install cask applications

cask 'git-credential-manager'

cask 'appcleaner'

cask 'istat-menus'
cask 'beardedspice'
cask 'rectangle'

cask 'bluejeans'
cask 'discord'
cask 'keybase'
cask 'skype'
cask 'slack'
cask 'zoom'
cask 'grammarly'

cask 'spotify'
cask 'vlc'

cask 'lens'
cask 'docker'
cask 'iterm2'
cask 'ngrok'
cask 'pycharm-ce'
cask 'visual-studio-code'

cask 'brave-browser'
cask 'firefox-developer-edition'
cask 'google-chrome-canary'
cask 'opera-developer'
cask 'tor-browser'

cask 'mysqlworkbench'
cask 'pgadmin4'

cask 'microsoft-auto-update'
cask 'microsoft-office'
cask 'microsoft-teams'

cask 'diffmerge'
cask 'sourcetree'
cask 'the-unarchiver'

cask 'logitech-g-hub'
cask "logi-options-plus"

brew "powerlevel10k"
brew "tfswitch"
brew "tgswitch"
brew "golangci-lint"
brew "goreleaser"
brew "heroku"

# Install Mac AppStore applications

# mas "harvest", id: 506189836
mas "Numbers", id: 409203825
mas "Grammarly for Safari", id: 1462114288
mas "WhatsApp", id: 1147396723

# Install vscode extensions
vscode "aaron-bond.better-comments"
vscode "codezombiech.gitignore"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitLab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "kuscamara.remove-unused-imports"
vscode "mechatroner.rainbow-csv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.atom-keybindings"
vscode "ms-vscode.makefile-tools"
vscode "peterj.proto"
vscode "rangav.vscode-thunder-client"
vscode "redhat.vscode-yaml"
vscode "sleistner.vscode-fileutils"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "usernamehw.errorlens"
vscode "VisualStudioExptTeam.intellicode-api-usage-examples"
vscode "VisualStudioExptTeam.vscodeintellicode"
vscode "vscode-icons-team.vscode-icons"
vscode "ziglang.vscode-zig"
